In [1]:
import numpy as np
import pandas as pd

In [2]:
col_Names=["sales_date", "sales_year", "cus_id", "cus_age",
           "cus_gender", "cus_country", "cus_state", "prod_category",
           "prod_subcategory", "product", "ord_quantity", "unit_cost", 
           "unit_price", "cost","revenue"]

df = pd.read_csv('sales_data.csv',
                 names= col_Names, 
                 on_bad_lines = 'skip',
                 sep= '\t')

df.head()

,sales_date,sales_year,cus_id,cus_age,cus_gender,cus_country,cus_state,prod_category,prod_subcategory,product,ord_quantity,unit_cost,unit_price,cost,revenue
0,2013-11-26,2013.0,11019.0,19.0,M,Canada,British Columbia,Accessories,Bike Racks,Hitch Rack - 4-Bike,8.0,45.0,120.0,360.0,950.0
1,2015-11-26,2015.0,11019.0,19.0,M,Canada,British Columbia,Accessories,Bike Racks,Hitch Rack - 4-Bike,8.0,45.0,120.0,360.0,950.0
2,2014-03-23,2014.0,11039.0,49.0,M,Australia,New South Wales,Accessories,Bike Racks,Hitch Rack - 4-Bike,23.0,45.0,120.0,1035.0,2401.0
3,2016-03-23,2016.0,11039.0,49.0,M,Australia,New South Wales,Accessories,Bike Racks,Hitch Rack - 4-Bike,20.0,45.0,120.0,900.0,2088.0
4,2014-05-15,2014.0,11046.0,47.0,F,Australia,New South Wales,Accessories,Bike Racks,Hitch Rack - 4-Bike,4.0,45.0,120.0,180.0,418.0

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 113037 entries, 0 to 113036
Data columns (total 15 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   sales_date        113037 non-null  object
 1   sales_year        113036 non-null  float64
 2   cus_id            113036 non-null  float64
 3   cus_age           113036 non-null  float64
 4   cus_gender        113036 non-null  object
 5   cus_country       113036 non-null  object
 6   cus_state         113036 non-null  object
 7   prod_category     113036 non-null  object
 8   prod_subcategory  113036 non-null  object
 9   product           113036 non-null  object
 10  ord_quantity      113036 non-null  float64
 11  unit_cost         113036 non-null  float64
 12  unit_price        113036 non-null  float64
 13  cost              113036 non-null  float64
 14  revenue           113036 non-null  float64
dtypes: float64(8), object(7)
memory usage: 12.9+ MB

In [4]:
df.duplicated().sum()

1000

In [5]:
df.drop_duplicates(inplace = True)

In [6]:
df[df['cus_age'].isna()]

,sales_date,sales_year,cus_id,cus_age,cus_gender,cus_country,cus_state,prod_category,prod_subcategory,product,ord_quantity,unit_cost,unit_price,cost,revenue
113036,\.,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [7]:
df.dropna(inplace = True)

In [8]:
df.describe()

,sales_year,cus_id,cus_age,ord_quantity,unit_cost,unit_price,cost,revenue
count,112036.000000,112036.000000,112036.000000,112036.000000,112036.000000,112036.000000,112036.000000,112036.000000
mean,2014.400925,19223.313917,35.919508,11.904254,267.819603,453.850628,471.103333,757.138527
std,1.273327,5306.209041,11.016543,9.564877,550.218722,922.751848,886.971635,1312.061623
min,2011.000000,11000.000000,17.000000,1.000000,1.000000,2.000000,1.000000,2.000000
25%,2013.000000,14608.000000,28.000000,2.000000,2.000000,5.000000,28.000000,64.000000
50%,2014.000000,18637.000000,35.000000,10.000000,9.000000,25.000000,112.000000,226.000000
75%,2016.000000,23470.000000,43.000000,20.000000,42.000000,70.000000,442.000000,806.000000
max,2016.000000,29483.000000,87.000000,32.000000,2171.000000,3578.000000,42978.000000,58074.000000